In [1]:
from sqlfaker.database import Database

my_db = Database(db_name="campusdb", dbs_type="mysql")

my_db.add_table(table_name="studiengang", n_rows=5)
my_db.add_table(table_name="student", n_rows=10)

my_db.tables["studiengang"].add_primary_key(column_name="studiengang_id")
my_db.tables["studiengang"].add_column(column_name="bezeichnung", data_type="varchar(50)", data_target="job")
my_db.tables["studiengang"].add_column(column_name="start_datum", data_type="date", data_target="date")

my_db.tables["student"].add_primary_key(column_name="student_id")
my_db.tables["student"].add_column(column_name="firstname", data_type="varchar(50)", data_target="first_name")
my_db.tables["student"].add_column(column_name="lastname", data_type="varchar(50)", data_target="last_name")
my_db.tables["student"].add_foreign_key(column_name="studiengang_id", target_table="studiengang", target_column="studiengang_id")

my_db.generate_data()

In [2]:
print(my_db.return_ddl())

DROP DATABASE IF EXISTS campusdb;
CREATE DATABASE campusdb;
USE campusdb;

CREATE TABLE `campusdb`.`studiengang` (
	`studiengang_id` INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
	`bezeichnung` VARCHAR(50),
	`start_datum` DATE
);

CREATE TABLE `campusdb`.`student` (
	`student_id` INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
	`firstname` VARCHAR(50),
	`lastname` VARCHAR(50),
	`studiengang_id` INT,
	FOREIGN KEY (studiengang_id) REFERENCES studiengang(studiengang_id)
);

In [3]:
print(my_db.return_dml())

USE campusdb;

INSERT INTO `campusdb`.`studiengang` (`studiengang_id`, `bezeichnung`, `start_datum`) VALUES
	(1, 'Pfleger', '1999-04-21'),
	(2, 'Binnenschiffer', '1977-10-29'),
	(3, 'Bankkaufmann', '1981-05-14'),
	(4, 'Artist', '1997-05-11'),
	(5, 'Winzer', '2005-11-17');

INSERT INTO `campusdb`.`student` (`student_id`, `firstname`, `lastname`, `studiengang_id`) VALUES
	(1, 'Ingo', 'Wilmsen', 3),
	(2, 'Hans-Wilhelm', 'Sorgatz', 5),
	(3, 'Johanna', 'Jessel', 4),
	(4, 'Anne-Kathrin', 'Trupp', 3),
	(5, 'Karsten', 'Jähn', 1),
	(6, 'Ira', 'Häring', 2),
	(7, 'Wilhelm', 'Bolander', 1),
	(8, 'Toni', 'Albers', 3),
	(9, 'Elias', 'Pergande', 2),
	(10, 'Amelie', 'Barkholz', 5);

In [4]:
hr = Database(db_name="hr", dbs_type="mysql")

hr.add_table(table_name="employee", n_rows=10)

hr.tables["employee"].add_primary_key(column_name="emp_id")
hr.tables["employee"].add_column(column_name="firstname", data_type="varchar(50)", data_target="first_name")
hr.tables["employee"].add_column(column_name="lastname", data_type="varchar(50)", data_target="last_name")
hr.tables["employee"].add_foreign_key(column_name="boss_id", target_table="employee", target_column="emp_id")
hr.generate_data(recursive = True)

In [6]:
print(hr.return_dml())

USE hr;

INSERT INTO `hr`.`employee` (`emp_id`, `firstname`, `lastname`, `boss_id`) VALUES
	(1, 'Ahmet', 'Kambs', NULL),
	(2, 'Wilma', 'Trüb', 0),
	(3, 'Lilo', 'Köster', 1),
	(4, 'Kira', 'Niemeier', 2),
	(5, 'Wilfried', 'Atzler', 3),
	(6, 'Ulf', 'Zorbach', 4),
	(7, 'Alena', 'Hahn', 5),
	(8, 'Augusta', 'Schäfer', 6),
	(9, 'Karlfried', 'Schönland', 7),
	(10, 'Milan', 'Beyer', 8);